{
  "target_vocab_size": 7705,
  "base_specials": {
    "<PAD>": 0,
    "<UNK>": 1,
    "<BOS>": 2,
    "<EOS>": 3,
    "<MASK>": 4
  },
  "added_tokens": [
    "<|user|>",
    "<|bot|>",
    "<|endoftext|>"
  ],
  "merges": {
    "124,112": 264,
    "119,125": 265,
    "113,118": 266,
    "105,124": 267,
    "122,109": 268,
    "105,118": 269,
    "264,109": 270,
    "129,265": 271,
    "124,119": 272,
    "113,124": 273,
    "109,122": 274,
    "113,123": 275,
    "119,118": 276,
    "116,116": 277,
    "112,109": 278,
    "266,111": 279,
    "117,109": 280,
    "109,123": 281,
    "119,122": 282,
    "126,109": 283,
    "112,267": 284,
    "105,122": 285,
    "105,123": 286,
    "112,119": 287,
    "118,119": 288,
    "47,123": 289,
    "123,109": 290,
    "108,119": 291,
    "269,108": 292,
    "109,118": 293,
    "109,124": 294,
    "264,267": 295,
    "119,110": 296,
    "109,108": 297,
    "123,124": 298,
    "111,119": 299,
    "105,129": 300,
    "105,116": 301,
    "127,109": 302,
    "113,108": 303,
    "47,124": 304,
    "112,105": 305,
    "106,109": 306,
    "116,113": 307,
    "116,109": 308,
    "127,284": 309,
    "124,113": 310,
    "123,119": 311,
    "105,268": 312,
    "116,119": 313,
    "123,54": 314,
    "107,112": 315,
    "105,277": 316,
    "116,108": 317,
    "122,119": 318,
    "115,109": 319,
    "113,47": 320,
    "125,124": 321,
    "126,274": 322,
    "305,283": 323,
    "125,123": 324,
    "127,113": 325,
    "265,124": 326,
    "105,108": 327,
    "105,106": 328,
    "119,108": 329,
    "110,282": 330,
    "118,109": 331,
    "276,109": 332,
    "111,112": 333,
    "107,119": 334,
    "108,303": 335,
    "122,113": 336,
    "127,286": 337,
    "95,284": 338,
    "270,129": 339,
    "111,294": 340,
    "123,125": 341,
    "107,269": 342,
    "265,317": 343,
    "109,54": 344,
    "265,122": 345,
    "117,119": 346,
    "113,107": 347,
    "129,281": 348,
    "333,124": 349,
    "129,54": 350,
    "276,304": 351,
    "118,304": 352,
    "273,289": 353,
    "106,321": 354,
    "120,109": 355,
    "307,319": 356,
    "287,127": 357,
    "125,118": 358,
    "119,115": 359,
    "271,122": 360,
    "328,326": 361,
    "117,129": 362,
    "125,116": 363,
    "278,268": 364,
    "108,351": 365,
    "288,127": 366,
    "120,116": 367,
    "113,116": 368,
    "69,42": 369,
    "124,274": 370,
    "269,124": 371,
    "266,115": 372,
    "127,112": 373,
    "105,107": 374,
    "106,129": 375,
    "320,117": 376,
    "108,300": 377,
    "295,289": 378,
    "269,115": 379,
    "123,112": 380,
    "264,279": 381,
    "110,109": 382,
    "105,117": 383,
    "111,109": 384,
    "118,124": 385,
    "269,129": 386,
    "113,122": 387,
    "124,109": 388,
    "264,372": 389,
    "288,124": 390,
    "125,122": 391,
    "117,266": 392,
    "109,116": 393,
    "325,264": 394,
    "120,318": 395,
    "310,280": 396,
    "348,52": 397,
    "311,280": 398,
    "121,125": 399,
    "92,278": 400,
    "373,129": 401,
    "272,119": 402,
    "270,268": 403,
    "299,329": 404,
    "106,116": 405,
    "115,366": 406,
    "316,129": 407,
    "113,110": 408,
    "270,122": 409,
    "123,107": 410,
    "122,105": 411,
    "127,371": 412,
    "120,120": 413,
    "120,308": 414,
    "109,322": 415,
    "47,268": 416,
    "325,277": 417,
    "299,279": 418,
    "125,298": 419,
    "107,345": 420,
    "81,86": 421,
    "302,277": 422,
    "116,129": 423,
    "285,124": 424,
    "293,124": 425,
    "105,319": 426,
    "127,343": 427,
    "266,109": 428,
    "123,278": 429,
    "268,407": 430,
    "267,109": 431,
    "420,290": 432,
    "320,277": 433,
    "293,108": 434,
    "290,109": 435,
    "264,275": 436,
    "301,123": 437,
    "84,421": 438,
    "438,83": 439,
    "422,52": 440,
    "125,290": 441,
    "127,282": 442,
    "114,419": 443,
    "310,120": 444,
    "107,115": 445,
    "123,105": 446,
    "279,54": 447,
    "273,54": 448,
    "120,119": 449,
    "113,117": 450,
    "268,110": 451,
    "117,363": 452,
    "452,444": 453,
    "453,307": 454,
    "454,297": 455,
    "410,287": 456,
    "126,275": 457,
    "280,385": 458,
    "367,324": 459,
    "124,285": 460,
    "68,105": 461,
    "460,340": 462,
    "462,369": 463,
    "405,379": 464,
    "464,42": 465,
    "112,451": 466,
    "42,70": 467,
    "68,55": 468,
    "468,105": 469,
    "469,70": 470,
    "109,399": 471,
    "471,437": 472,
    "392,324": 473,
    "127,287": 474,
    "415,129": 475,
    "288,52": 476,
    "457,273": 477,
    "274,54": 478,
    "277,109": 479,
    "380,343": 480,
    "265,118": 481,
    "466,369": 482,
    "105,368": 483,
    "125,120": 484,
    "281,54": 485,
    "111,428": 486,
    "113,283": 487,
    "479,384": 488,
    "108,109": 489,
    "117,300": 490,
    "313,359": 491,
    "486,274": 492,
    "107,124": 493,
    "463,103": 494,
    "494,465": 495,
    "364,470": 496,
    "120,274": 497,
    "113,276": 498,
    "481,108": 499,
    "107,105": 500,
    "271,416": 501,
    "355,119": 502,
    "502,414": 503,
    "346,268": 504,
    "110,119": 505,
    "271,54": 506,
    "270,118": 507,
    "331,297": 508,
    "129,109": 509,
    "377,54": 510,
    "331,127": 511,
    "124,54": 512,
    "119,116": 513,
    "402,54": 514,
    "113,349": 515,
    "105,266": 516,
    "112,52": 517,
    "73,76": 518,
    "285,108": 519,
    "280,54": 520,
    "278,118": 521,
    "336,349": 522,
    "291,281": 523,
    "123,71": 524,
    "113,111": 525,
    "123,273": 526,
    "106,125": 527,
    "266,108": 528,
    "118,347": 529,
    "492,279": 530,
    "125,268": 531,
    "97,87": 532,
    "532,93": 533,
    "56,54": 534,
    "123,272": 535,
    "268,267": 536,
    "335,352": 537,
    "122,129": 538,
    "107,109": 539,
    "309,289": 540,
    "110,318": 541,
    "541,117": 542,
    "128,124": 543,
    "301,115": 544,
    "267,315": 545,
    "117,332": 546,
    "77,90": 547,
    "490,306": 548,
    "109,283": 549,
    "105,111": 550,
    "106,119": 551,
    "334,117": 552,
    "273,71": 553,
    "276,111": 554,
    "295,71": 555,
    "456,513": 556,
    "334,488": 557,
    "117,125": 558,
    "127,521": 559,
    "112,450": 560,
    "267,498": 561,
    "114,119": 562,
    "127,300": 563,
    "296,110": 564,
    "396,123": 565,
    "313,124": 566,
    "112,274": 567,
    "105,315": 568,
    "107,285": 569,
    "280,269": 570,
    "122,125": 571,
    "120,321": 572,
    "327,108": 573,
    "116,286": 574,
    "113,277": 575,
    "264,379": 576,
    "126,113": 577,
    "78,282": 578,
    "518,76": 579,
    "111,125": 580,
    "299,124": 581,
    "87,90": 582,
    "115,54": 583,
    "276,423": 584,
    "106,308": 585,
    "123,300": 586,
    "127,119": 587,
    "106,122": 588,
    "119,409": 589,
    "313,283": 590,
    "558,315": 591,
    "107,278": 592,
    "294,54": 593,
    "359,300": 594,
    "310,276": 595,
    "117,54": 596,
    "500,441": 597,
    "75,301": 598,
    "127,364": 599,
    "346,577": 600,
    "278,116": 601,
    "342,304": 602,
    "341,268": 603,
    "306,597": 604,
    "334,280": 605,
    "293,530": 606,
    "388,277": 607,
    "111,487": 608,
    "305,413": 609,
    "107,363": 610,
    "348,54": 611,
    "111,536": 612,
    "108,125": 613,
    "112,286": 614,
    "108,294": 615,
    "615,483": 616,
    "119,517": 617,
    "529,109": 618,
    "116,294": 619,
    "105,115": 620,
    "275,112": 621,
    "91,531": 622,
    "622,41": 623,
    "116,124": 624,
    "47,277": 625,
    "341,117": 626,
    "598,610": 627,
    "627,431": 628,
    "305,108": 629,
    "117,426": 630,
    "411,266": 631,
    "320,283": 632,
    "306,293": 633,
    "124,426": 634,
    "106,294": 635,
    "533,90": 636,
    "120,424": 637,
    "432,41": 638,
    "601,120": 639,
    "395,613": 640,
    "322,526": 641,
    "328,308": 642,
    "268,327": 643,
    "358,113": 644,
    "107,316": 645,
    "123,120": 646,
    "374,115": 647,
    "113,120": 648,
    "398,381": 649,
    "75,269": 650,
    "318,127": 651,
    "303,109": 652,
    "117,106": 653,
    "73,90": 654,
    "124,129": 655,
    "87,110": 656,
    "110,336": 657,
    "657,434": 658,
    "341,624": 659,
    "268,659": 660,
    "640,493": 661,
    "107,308": 662,
    "275,124": 663,
    "105,280": 664,
    "110,358": 665,
    "120,268": 666,
    "120,293": 667,
    "315,269": 668,
    "61,54": 669,
    "270,117": 670,
    "116,267": 671,
    "57,56": 672,
    "105,54": 673,
    "482,579": 674,
    "644,641": 675,
    "123,52": 676,
    "302,268": 677,
    "73,81": 678,
    "57,57": 679,
    "117,269": 680,
    "64,54": 681,
    "331,322": 682,
    "295,54": 683,
    "87,86": 684,
    "91,81": 685,
    "124,544": 686,
    "331,543": 687,
    "265,349": 688,
    "109,267": 689,
    "108,113": 690,
    "119,127": 691,
    "60,54": 692,
    "112,275": 693,
    "281,124": 694,
    "509,285": 695,
    "129,52": 696,
    "290,54": 697,
    "382,268": 698,
    "105,110": 699,
    "127,105": 700,
    "57,58": 701,
    "291,71": 702,
    "297,54": 703,
    "77,92": 704,
    "107,276": 705,
    "62,54": 706,
    "109,128": 707,
    "108,408": 708,
    "123,287": 709,
    "287,355": 710,
    "274,123": 711,
    "298,125": 712,
    "382,393": 713,
    "505,329": 714,
    "282,124": 715,
    "298,424": 716,
    "271,71": 717,
    "105,283": 718,
    "499,123": 719,
    "119,329": 720,
    "58,54": 721,
    "105,409": 722,
    "79,720": 723,
    "318,119": 724,
    "286,115": 725,
    "268,109": 726,
    "76,704": 727,
    "727,678": 728,
    "728,84": 729,
    "63,54": 730,
    "347,301": 731,
    "386,381": 732,
    "442,115": 733,
    "108,274": 734,
    "56,56": 735,
    "268,123": 736,
    "635,370": 737,
    "105,120": 738,
    "75,119": 739,
    "107,574": 740,
    "265,333": 741,
    "281,123": 742,
    "395,585": 743,
    "59,54": 744,
    "111,116": 745,
    "562,106": 746,
    "109,120": 747,
    "80,87": 748,
    "93,86": 749,
    "278,289": 750,
    "105,126": 751,
    "117,282": 752,
    "108,425": 753,
    "546,350": 754,
    "268,298": 755,
    "273,109": 756,
    "374,124": 757,
    "112,265": 758,
    "65,54": 759,
    "527,129": 760,
    "107,113": 761,
    "106,327": 762,
    "73,86": 763,
    "291,107": 764,
    "119,317": 765,
    "327,109": 766,
    "113,268": 767,
    "467,496": 768,
    "117,267": 769,
    "77,118": 770,
    "600,109": 771,
    "57,54": 772,
    "116,285": 773,
    "118,515": 774,
    "116,554": 775,
    "117,329": 776,
    "270,387": 777,
    "124,279": 778,
    "708,698": 779,
    "523,352": 780,
    "124,587": 781,
    "373,113": 782,
    "322,129": 783,
    "505,268": 784,
    "776,393": 785,
    "107,343": 786,
    "446,303": 787,
    "110,122": 788,
    "291,279": 789,
    "286,109": 790,
    "380,648": 791,
    "546,129": 792,
    "712,753": 793,
    "685,92": 794,
    "406,54": 795,
    "346,298": 796,
    "117,386": 797,
    "699,370": 798,
    "59,71": 799,
    "123,127": 800,
    "456,773": 801,
    "801,791": 802,
    "301,563": 803,
    "803,123": 804,
    "118,54": 805,
    "609,293": 806,
    "118,664": 807,
    "106,647": 808,
    "106,525": 809,
    "118,125": 810,
    "779,385": 811,
    "87,391": 812,
    "65,71": 813,
    "119,290": 814,
    "105,384": 815,
    "276,54": 816,
    "662,269": 817,
    "124,126": 818,
    "700,273": 819,
    "123,719": 820,
    "606,52": 821,
    "64,71": 822,
    "570,71": 823,
    "302,722": 824,
    "58,71": 825,
    "57,60": 826,
    "97,265": 827,
    "107,313": 828,
    "398,332": 829,
    "61,71": 830,
    "117,275": 831,
    "522,54": 832,
    "116,273": 833,
    "302,109": 834,
    "749,81": 835,
    "549,118": 836,
    "653,274": 837,
    "112,125": 838,
    "392,321": 839,
    "666,124": 840,
    "297,71": 841,
    "339,416": 842,
    "110,387": 843,
    "92,81": 844,
    "126,119": 845,
    "675,129": 846,
    "127,266": 847,
    "123,357": 848,
    "77,86": 849,
    "287,280": 850,
    "116,105": 851,
    "58,56": 852,
    "62,71": 853,
    "843,298": 854,
    "57,59": 855,
    "111,274": 856,
    "309,71": 857,
    "550,516": 858,
    "287,298": 859,
    "859,393": 860,
    "120,112": 861,
    "63,71": 862,
    "266,272": 863,
    "291,111": 864,
    "85,73": 865,
    "740,123": 866,
    "291,54": 867,
    "366,54": 868,
    "323,352": 869,
    "432,54": 870,
    "594,54": 871,
    "743,117": 872,
    "108,54": 873,
    "116,269": 874,
    "285,115": 875,
    "410,122": 876,
    "876,545": 877,
    "120,125": 878,
    "367,300": 879,
    "341,413": 880,
    "127,425": 881,
    "109,543": 882,
    "288,54": 883,
    "572,274": 884,
    "286,124": 885,
    "442,317": 886,
    "115,528": 887,
    "298,575": 888,
    "313,127": 889,
    "123,280": 890,
    "890,277": 891,
    "272,510": 892,
    "509,105": 893,
    "793,123": 894,
    "594,52": 895,
    "306,307": 896,
    "264,269": 897,
    "113,265": 898,
    "396,54": 899,
    "109,285": 900,
    "288,381": 901,
    "291,127": 902,
    "60,71": 903,
    "833,124": 904,
    "904,308": 905,
    "278,519": 906,
    "844,684": 907,
    "619,289": 908,
    "127,545": 909,
    "57,61": 910,
    "112,391": 911,
    "119,322": 912,
    "87,95": 913,
    "913,86": 914,
    "330,117": 915,
    "874,580": 916,
    "106,316": 917,
    "347,115": 918,
    "108,266": 919,
    "120,336": 920,
    "299,54": 921,
    "272,122": 922,
    "105,264": 923,
    "116,125": 924,
    "106,324": 925,
    "127,122": 926,
    "118,458": 927,
    "93,85": 928,
    "111,387": 929,
    "929,116": 930,
    "739,488": 931,
    "106,328": 932,
    "78,582": 933,
    "108,336": 934,
    "334,298": 935,
    "654,81": 936,
    "936,73": 937,
    "430,71": 938,
    "57,71": 939,
    "59,56": 940,
    "123,274": 941,
    "916,815": 942,
    "122,350": 943,
    "117,515": 944,
    "123,279": 945,
    "896,549": 946,
    "332,54": 947,
    "126,273": 948,
    "62,56": 949,
    "302,116": 950,
    "272,317": 951,
    "724,117": 952,
    "665,54": 953,
    "113,126": 954,
    "77,467": 955,
    "484,54": 956,
    "882,107": 957,
    "810,837": 958,
    "375,109": 959,
    "107,273": 960,
    "116,110": 961,
    "313,111": 962,
    "80,109": 963,
    "110,374": 964,
    "840,655": 965,
    "335,54": 966,
    "849,92": 967,
    "124,642": 968,
    "391,118": 969,
    "367,269": 970,
    "111,111": 971,
    "129,71": 972,
    "127,276": 973,
    "61,56": 974,
    "108,267": 975,
    "107,312": 976,
    "116,663": 977,
    "282,123": 978,
    "105,387": 979,
    "110,528": 980,
    "637,458": 981,
    "429,289": 982,
    "112,519": 983,
    "755,105": 984,
    "984,391": 985,
    "985,371": 986,
    "445,294": 987,
    "303,300": 988,
    "272,752": 989,
    "989,651": 990,
    "283,313": 991,
    "112,113": 992,
    "47,283": 993,
    "107,321": 994,
    "535,120": 995,
    "616,123": 996,
    "288,290": 997,
    "123,117": 998,
    "769,370": 999,
    "390,71": 1000,
    "127,351": 1001,
    "110,363": 1002,
    "552,884": 1003,
    "123,355": 1004,
    "116,350": 1005,
    "126,279": 1006,
    "393,290": 1007,
    "57,64": 1008,
    "388,568": 1009,
    "643,129": 1010,
    "107,525": 1011,
    "1011,312": 1012,
    "1012,124": 1013,
    "113,130": 1014,
    "529,344": 1015,
    "275,352": 1016,
    "588,285": 1017,
    "113,281": 1018,
    "127,621": 1019,
    "403,54": 1020,
    "81,118": 1021,
    "785,54": 1022,
    "915,561": 1023,
    "106,694": 1024,
    "107,425": 1025,
    "620,281": 1026,
    "745,327": 1027,
    "127,267": 1028,
    "123,301": 1029,
    "124,538": 1030,
    "264,688": 1031,
    "299,322": 1032,
    "1032,927": 1033,
    "49,768": 1034,
    "893,517": 1035,
    "652,673": 1036,
    "637,129": 1037,
    "112,292": 1038,
    "110,487": 1039,
    "298,292": 1040,
    "65,56": 1041,
    "81,47": 1042,
    "1042,117": 1043,
    "107,344": 1044,
    "123,282": 1045,
    "446,280": 1046,
    "268,301": 1047,
    "395,126": 1048,
    "118,279": 1049,
    "272,377": 1050,
    "106,688": 1051,
    "299,71": 1052,
    "124,969": 1053,
    "57,62": 1054,
    "63,56": 1055,
    "119,667": 1056,
    "306,784": 1057,
    "574,124": 1058,
    "404,54": 1059,
    "595,54": 1060,
    "421,933": 1061,
    "1061,865": 1062,
    "1062,907": 1063,
    "835,94": 1064,
    "1064,547": 1065,
    "1065,794": 1066,
    "1066,97": 1067,
    "307,1017": 1068,
    "109,315": 1069,
    "770,530": 1070,
    "388,293": 1071,
    "381,123": 1072,
    "399,281": 1073,
    "107,301": 1074,
    "60,56": 1075,
    "122,358": 1076,
    "764,922": 1077,
    "110,726": 1078,
    "442,583": 1079,
    "125,458": 1080,
    "115,303": 1081,
    "290,267": 1082,
    "580,742": 1083,
    "73,75": 1084,
    "271,625": 1085,
    "64,383": 1086,
    "120,117": 1087,
    "265,314": 1088,
    "311,52": 1089,
    "411,971": 1090,
    "1090,279": 1091,
    "566,123": 1092,
    "113,54": 1093,
    "705,124": 1094,
    "109,327": 1095,
    "277,119": 1096,
    "120,122": 1097,
    "80,691": 1098,
    "686,279": 1099,
    "117,766": 1100,
    "109,286": 1101,
    "110,125": 1102,
    "112,345": 1103,
    "124,411": 1104,
    "834,115": 1105,
    "269,589": 1106,
    "668,731": 1107,
    "117,731": 1108,
    "475,332": 1109,
    "85,81": 1110,
    "315,54": 1111,
    "286,123": 1112,
    "782,315": 1113,
    "268,108": 1114,
    "293,562": 1115,
    "109,109": 1116,
    "671,274": 1117,
    "751,483": 1118,
    "1118,642": 1119,
    "127,285": 1120,
    "1028,274": 1121,
    "313,512": 1122,
    "110,266": 1123,
    "414,790": 1124,
    "926,554": 1125,
    "326,54": 1126,
    "279,71": 1127,
    "123,346": 1128,
    "489,981": 1129,
    "334,317": 1130,
    "267,391": 1131,
    "758,697": 1132,
    "92,119": 1133,
    "482,439": 1134,
    "270,290": 1135,
    "762,54": 1136,
    "111,122": 1137,
    "603,54": 1138,
    "287,108": 1139,
    "302,625": 1140,
    "278,285": 1141,
    "713,279": 1142,
    "106,329": 1143,
    "106,268": 1144,
    "273,301": 1145,
    "105,497": 1146,
    "107,267": 1147,
    "109,568": 1148,
    "977,293": 1149,
    "275,54": 1150,
    "124,571": 1151,
    "358,310": 1152,
    "1152,116": 1153,
    "274,314": 1154,
    "802,123": 1155,
    "975,281": 1156,
    "609,129": 1157,
    "284,109": 1158,
    "588,269": 1159,
    "264,814": 1160,
    "117,419": 1161,
    "340,123": 1162,
    "110,383": 1163,
    "337,352": 1164,
    "1105,434": 1165,
    "1021,1023": 1166,
    "92,1069": 1167,
    "1167,288": 1168,
    "1168,962": 1169,
    "119,112": 1170,
    "919,118": 1171,
    "412,297": 1172,
    "331,113": 1173,
    "788,988": 1174,
    "290,293": 1175,
    "287,124": 1176,
    "527,368": 1177,
    "1177,124": 1178,
    "937,52": 1179,
    "950,605": 1180,
    "1115,129": 1181,
    "73,107": 1182,
    "898,123": 1183,
    "105,413": 1184,
    "368,273": 1185,
    "358,734": 1186,
    "127,544": 1187,
    "374,109": 1188,
    "85,109": 1189,
    "57,63": 1190,
    "303,281": 1191,
    "764,1080": 1192,
    "105,125": 1193,
    "85,386": 1194,
    "880,715": 1195,
    "1195,297": 1196,
    "675,350": 1197,
    "484,1156": 1198,
    "482,48": 1199,
    "1199,91": 1200,
    "1200,75": 1201,
    "1201,748": 1202,
    "1202,84": 1203,
    "1203,654": 1204,
    "1204,91": 1205,
    "1205,80": 1206,
    "1206,81": 1207,
    "1207,88": 1208,
    "729,91": 1209,
    "439,1034": 1210,
    "298,268": 1211,
    "266,948": 1212,
    "401,71": 1213,
    "120,516": 1214,
    "828,290": 1215,
    "110,767": 1216,
    "409,54": 1217,
    "1189,1107": 1218,
    "75,278": 1219,
    "1219,1108": 1220,
    "75,954": 1221,
    "1221,368": 1222,
    "911,124": 1223,
    "106,923": 1224,
    "303,425": 1225,
    "129,593": 1226,
    "782,308": 1227,
    "446,283": 1228,
    "308,110": 1229,
    "861,332": 1230,
    "307,349": 1231,
    "1143,129": 1232,
    "489,991": 1233,
    "273,52": 1234,
    "65,64": 1235,
    "107,536": 1236,
    "364,54": 1237,
    "64,56": 1238,
    "64,60": 1239,
    "308,747": 1240,
    "1094,757": 1241,
    "111,664": 1242,
    "118,113": 1243,
    "564,711": 1244,
    "1169,696": 1245,
    "1070,52": 1246,
    "821,1220": 1247,
    "770,492": 1248,
    "1248,447": 1249,
    "107,284": 1250,
    "285,499": 1251,
    "342,1071": 1252,
    "403,289": 1253,
    "107,265": 1254,
    "108,347": 1255,
    "298,300": 1256,
    "973,734": 1257,
    "90,1095": 1258,
    "1045,538": 1259,
    "264,726": 1260,
    "592,445": 1261,
    "269,800": 1262,
    "1262,274": 1263,
    "107,282": 1264,
    "746,54": 1265,
    "480,352": 1266,
    "724,596": 1267,
    "348,370": 1268,
    "108,411": 1269,
    "124,350": 1270,
    "336,297": 1271,
    "449,307": 1272,
    "111,718": 1273,
    "110,313": 1274,
    "47,108": 1275,
    "301,1010": 1276,
    "491,279": 1277,
    "85,528": 1278,
    "964,1185": 1279,
    "120,918": 1280,
    "117,276": 1281,
    "311,276": 1282,
    "126,285": 1283,
    "60,58": 1284,
    "120,54": 1285,
    "117,273": 1286,
    "556,54": 1287,
    "319,747": 1288,
    "109,308": 1289,
    "65,65": 1290,
    "576,123": 1291,
    "110,751": 1292,
    "293,741": 1293,
    "52,735": 1294,
    "124,301": 1295,
    "723,959": 1296,
    "322,54": 1297,
    "268,286": 1298,
    "587,680": 1299,
    "1292,282": 1300,
    "290,961": 1301,
    "264,122": 1302,
    "1302,741": 1303,
    "264,54": 1304,
    "65,60": 1305,
    "631,297": 1306,
    "123,652": 1307,
    "113,128": 1308,
    "126,281": 1309,
    "551,359": 1310,
    "266,124": 1311,
    "1102,277": 1312,
    "110,268": 1313,
    "1048,1191": 1314,
    "612,54": 1315,
    "649,54": 1316,
    "758,290": 1317,
    "1159,315": 1318,
    "105,563": 1319,
    "1269,127": 1320,
    "320,108": 1321,
    "291,277": 1322,
    "1322,285": 1323,
    "272,359": 1324,
    "312,54": 1325,
    "64,61": 1326,
    "497,123": 1327,
    "390,54": 1328,
    "78,90": 1329,
    "1329,87": 1330,
    "1330,85": 1331,
    "95,77": 1332,
    "1332,74": 1333,
    "1333,794": 1334,
    "78,1116": 1335,
    "1134,467": 1336,
    "1182,766": 1337,
    "1337,117": 1338,
    "1338,347": 1339,
    "310,117": 1340,
    "413,279": 1341,
    "65,58": 1342,
    "310,987": 1343,
    "549,385": 1344,
    "639,297": 1345,
    "748,91": 1346,
    "1346,92": 1347,
    "1347,77": 1348,
    "1348,84": 1349,
    "88,76": 1350,
    "1350,78": 1351,
    "763,97": 1352,
    "763,91": 1353,
    "1353,95": 1354,
    "1354,547": 1355,
    "1355,91": 1356,
    "1356,467": 1357,
    "592,281": 1358,
    "110,345": 1359,
    "446,127": 1360,
    "60,61": 1361,
    "58,57": 1362,
    "62,62": 1363,
    "63,58": 1364,
    "60,59": 1365,
    "62,61": 1366,
    "60,65": 1367,
    "116,281": 1368,
    "109,117": 1369,
    "405,125": 1370,
    "370,54": 1371,
    "234,136": 1372,
    "114,359": 1373,
    "341,497": 1374,
    "356,71": 1375,
    "497,382": 1376,
    "1376,493": 1377,
    "341,118": 1378,
    "646,374": 1379,
    "1236,297": 1380,
    "716,297": 1381,
    "591,54": 1382,
    "695,123": 1383,
    "58,61": 1384,
    "110,621": 1385,
    "475,381": 1386,
    "311,54": 1387,
    "111,344": 1388,
    "839,485": 1389,
    "86,928": 1390,
    "1390,74": 1391,
    "1391,547": 1392,
    "569,54": 1393,
    "608,118": 1394,
    "1163,368": 1395,
    "806,841": 1396,
    "58,59": 1397,
    "60,62": 1398,
    "838,384": 1399,
    "507,54": 1400,
    "120,300": 1401,
    "58,64": 1402,
    "105,128": 1403,
    "1073,595": 1404,
    "59,59": 1405,
    "62,65": 1406,
    "60,60": 1407,
    "112,358": 1408,
    "63,64": 1409,
    "110,267": 1410,
    "117,324": 1411,
    "60,63": 1412,
    "474,308": 1413,
    "305,1006": 1414,
    "274,71": 1415,
    "115,575": 1416,
    "423,52": 1417,
    "84,77": 1418,
    "786,352": 1419,
    "1013,124": 1420,
    "1128,115": 1421,
    "281,355": 1422,
    "307,115": 1423,
    "1272,539": 1424,
    "1131,377": 1425,
    "491,123": 1426,
    "111,105": 1427,
    "1427,520": 1428,
    "110,116": 1429,
    "732,54": 1430,
    "834,583": 1431,
    "293,745": 1432,
    "1432,621": 1433,
    "80,113": 1434,
    "73,286": 1435,
    "1435,838": 1436,
    "1436,272": 1437,
    "1437,380": 1438,
    "306,568": 1439,
    "1340,279": 1440,
    "123,281": 1441,
    "968,54": 1442,
    "395,932": 1443,
    "1443,423": 1444,
    "120,875": 1445,
    "877,54": 1446,
    "108,431": 1447,
    "406,52": 1448,
    "53,61": 1449,
    "266,298": 1450,
    "64,58": 1451,
    "107,595": 1452,
    "336,585": 1453,
    "526,109": 1454,
    "1229,124": 1455,
    "346,117": 1456,
    "963,1096": 1457,
    "57,65": 1458,
    "108,387": 1459,
    "831,123": 1460,
    "63,57": 1461,
    "59,58": 1462,
    "62,58": 1463,
    "60,64": 1464,
    "118,297": 1465,
    "738,395": 1466,
    "62,57": 1467,
    "266,344": 1468,
    "886,54": 1469,
    "61,59": 1470,
    "403,71": 1471,
    "113,294": 1472,
    "61,58": 1473,
    "119,107": 1474,
    "283,116": 1475,
    "106,273": 1476,
    "1466,920": 1477,
    "1477,431": 1478,
    "588,279": 1479,
    "58,65": 1480,
    "992,333": 1481,
    "123,41": 1482,
    "668,384": 1483,
    "736,123": 1484,
    "600,344": 1485,
    "110,110": 1486,
    "117,1026": 1487,
    "203,138": 1488,
    "1488,1372": 1489,
    "383,120": 1490,
    "1296,41": 1491,
    "280,52": 1492,
    "1104,1475": 1493,
    "61,65": 1494,
    "586,123": 1495,
    "107,122": 1496,
    "280,118": 1497,
    "282,269": 1498,
    "1358,109": 1499,
    "1300,756": 1500,
    "87,78": 1501,
    "518,1110": 1502,
    "1502,91": 1503,
    "1503,685": 1504,
    "1504,684": 1505,
    "76,87": 1506,
    "1506,75": 1507,
    "1507,928": 1508,
    "1508,967": 1509,
    "271,52": 1510,
    "340,778": 1511,
    "123,123": 1512,
    "58,60": 1513,
    "61,61": 1514,
    "113,317": 1515,
    "441,108": 1516,
    "789,71": 1517,
    "64,62": 1518,
    "59,65": 1519,
    "64,65": 1520,
    "63,62": 1521,
    "998,424": 1522,
    "60,57": 1523,
    "107,296": 1524,
    "1524,382": 1525,
    "62,60": 1526,
    "334,513": 1527,
    "301,796": 1528,
    "124,516": 1529,
    "271,993": 1530,
    "1254,414": 1531,
    "645,297": 1532,
    "902,805": 1533,
    "880,814": 1534,
    "1534,108": 1535,
    "1212,561": 1536,
    "308,718": 1537,
    "403,52": 1538,
    "435,117": 1539,
    "449,124": 1540,
    "658,54": 1541,
    "631,314": 1542,
    "120,286": 1543,
    "313,298": 1544,
    "117,368": 1545,
    "986,54": 1546,
    "845,388": 1547,
    "106,292": 1548,
    "106,282": 1549,
    "109,611": 1550,
    "600,281": 1551,
    "280,71": 1552,
    "324,279": 1553,
    "1422,761": 1554,
    "1554,407": 1555,
    "580,129": 1556,
    "124,1403": 1557,
    "107,545": 1558,
    "270,596": 1559,
    "63,65": 1560,
    "752,1049": 1561,
    "61,57": 1562,
    "62,63": 1563,
    "64,57": 1564,
    "298,109": 1565,
    "394,71": 1566,
    "61,64": 1567,
    "110,344": 1568,
    "64,64": 1569,
    "107,129": 1570,
    "63,59": 1571,
    "1186,1040": 1572,
    "535,268": 1573,
    "665,118": 1574,
    "63,60": 1575,
    "125,407": 1576,
    "662,285": 1577,
    "266,107": 1578,
    "110,499": 1579,
    "268,399": 1580,
    "1580,767": 1581,
    "112,273": 1582,
    "59,61": 1583,
    "398,565": 1584,
    "427,352": 1585,
    "1165,54": 1586,
    "107,336": 1587,
    "272,54": 1588,
    "122,372": 1589,
    "503,54": 1590,
    "445,54": 1591,
    "124,293": 1592,
    "858,54": 1593,
    "1457,41": 1594,
    "276,539": 1595,
    "64,59": 1596,
    "301,54": 1597,
    "116,742": 1598,
    "1581,108": 1599,
    "306,1193": 1600,
    "1600,310": 1601,
    "1601,1002": 1602,
    "120,371": 1603,
    "576,314": 1604,
    "106,643": 1605,
    "58,62": 1606,
    "307,283": 1607,
    "59,62": 1608,
    "65,62": 1609,
    "552,120": 1610,
    "59,57": 1611,
    "422,54": 1612,
    "308,285": 1613,
    "294,123": 1614,
    "108,281": 1615,
    "266,370": 1616,
    "122,269": 1617,
    "61,62": 1618,
    "311,116": 1619,
    "268,111": 1620,
    "124,297": 1621,
    "59,63": 1622,
    "110,571": 1623,
    "266,388": 1624,
    "1624,755": 1625,
    "1411,347": 1626,
    "302,106": 1627,
    "108,71": 1628,
    "65,59": 1629,
    "281,314": 1630,
    "817,54": 1631,
    "268,344": 1632,
    "272,71": 1633,
    "116,428": 1634,
    "389,279": 1635,
    "1050,71": 1636,
    "81,92": 1637,
    "511,123": 1638,
    "107,268": 1639,
    "367,1188": 1640,
    "81,78": 1641,
    "80,73": 1642,
    "1642,94": 1643,
    "1643,77": 1644,
    "382,281": 1645,
    "281,71": 1646,
    "792,71": 1647,
    "336,120": 1648,
    "108,269": 1649,
    "1649,856": 1650,
    "1279,1018": 1651,
    "935,123": 1652,
    "560,54": 1653,
    "120,715": 1654,
    "1283,1472": 1655,
    "1224,1267": 1656,
    "666,123": 1657,
    "1657,1225": 1658,
    "65,63": 1659,
    "902,118": 1660,
    "271,1275": 1661,
    "1086,1449": 1662,
    "1662,1087": 1663,
    "85,276": 1664,
    "1664,377": 1665,
    "1665,53": 1666,
    "1666,91": 1667,
    "1667,1425": 1668,
    "1668,41": 1669,
    "122,265": 1670,
    "467,1627": 1671,
    "1671,1454": 1672,
    "1672,470": 1673,
    "774,54": 1674,
    "924,445": 1675,
    "313,290": 1676,
    "551,264": 1677,
    "394,326": 1678,
    "743,596": 1679,
    "341,315": 1680,
    "107,519": 1681,
    "336,315": 1682,
    "278,108": 1683,
    "370,1453": 1684,
    "119,52": 1685,
    "450,414": 1686,
    "63,63": 1687,
    "61,63": 1688,
    "120,1014": 1689,
    "1689,130": 1690,
    "113,109": 1691,
    "347,109": 1692,
    "405,647": 1693,
    "59,60": 1694,
    "864,314": 1695,
    "125,314": 1696,
    "110,286": 1697,
    "61,60": 1698,
    "288,697": 1699,
    "500,280": 1700,
    "267,66": 1701,
    "1294,56": 1702,
    "108,327": 1703,
    "307,120": 1704,
    "714,54": 1705,
    "71,71": 1706,
    "1068,350": 1707,
    "117,374": 1708,
    "339,71": 1709,
    "392,109": 1710,
    "123,292": 1711,
    "108,1589": 1712,
    "326,1307": 1713,
    "106,889": 1714,
    "784,1297": 1715,
    "307,107": 1716,
    "1151,344": 1717,
    "290,277": 1718,
    "112,276": 1719,
    "1184,268": 1720,
    "1720,761": 1721,
    "858,298": 1722,
    "646,715": 1723,
    "1723,123": 1724,
    "96,97": 1725,
    "1725,98": 1726,
    "1298,276": 1727,
    "108,318": 1728,
    "301,311": 1729,
    "393,129": 1730,
    "1174,54": 1731,
    "586,71": 1732,
    "110,285": 1733,
    "120,285": 1734,
    "62,64": 1735,
    "62,59": 1736,
    "1144,620": 1737,
    "117,568": 1738,
    "998,316": 1739,
    "298,285": 1740,
    "117,274": 1741,
    "707,960": 1742,
    "110,885": 1743,
    "92,364": 1744,
    "59,64": 1745,
    "124,1306": 1746,
    "418,71": 1747,
    "63,61": 1748,
    "620,279": 1749,
    "275,109": 1750,
    "851,125": 1751,
    "109,515": 1752,
    "267,119": 1753,
    "671,478": 1754,
    "1101,129": 1755,
    "489,107": 1756,
    "113,119": 1757,
    "552,367": 1758,
    "299,281": 1759,
    "522,71": 1760,
    "361,71": 1761,
    "695,314": 1762,
    "79,87": 1763,
    "1763,87": 1764,
    "1764,79": 1765,
    "1765,1418": 1766,
    "865,88": 1767,
    "80,547": 1768,
    "1768,955": 1769,
    "1013,388": 1770,
    "925,129": 1771,
    "106,318": 1772,
    "497,1025": 1773,
    "110,274": 1774,
    "736,355": 1775,
    "1489,156": 1776,
    "108,308": 1777,
    "120,719": 1778,
    "1540,1753": 1779,
    "373,756": 1780,
    "999,71": 1781,
    "1268,510": 1782,
    "449,987": 1783,
    "562,266": 1784,
    "866,281": 1785,
    "311,71": 1786,
    "282,54": 1787,
    "1379,1183": 1788,
    "1707,1440": 1789,
    "1789,123": 1790,
    "62,1087": 1791,
    "463,465": 1792,
    "84,81": 1793,
    "1793,74": 1794,
    "1794,90": 1795,
    "1795,654": 1796,
    "1796,97": 1797,
    "439,768": 1798,
    "355,269": 1799,
    "1799,321": 1800,
    "108,525": 1801,
    "1801,1145": 1802,
    "111,358": 1803,
    "332,71": 1804,
    "1170,54": 1805,
    "264,387": 1806,
    "511,314": 1807,
    "287,329": 1808,
    "123,347": 1809,
    "1809,583": 1810,
    "117,875": 1811,
    "123,889": 1812,
    "491,297": 1813,
    "535,538": 1814,
    "671,393": 1815,
    "305,653": 1816,
    "1816,391": 1817,
    "716,123": 1818,
    "387,276": 1819,
    "872,71": 1820,
    "120,499": 1821,
    "105,921": 1822,
    "307,382": 1823,
    "1227,54": 1824,
    "990,54": 1825,
    "811,54": 1826,
    "489,307": 1827,
    "1097,1578": 1828,
    "1828,648": 1829,
    "1829,301": 1830,
    "341,106": 1831,
    "1429,550": 1832,
    "417,54": 1833,
    "337,112": 1834,
    "113,52": 1835,
    "1620,519": 1836,
    "1498,384": 1837,
    "570,52": 1838,
    "563,54": 1839,
    "509,277": 1840,
    "709,281": 1841,
    "354,370": 1842,
    "689,279": 1843,
    "1404,123": 1844,
    "1233,120": 1845,
    "86,1685": 1846,
    "58,63": 1847,
    "120,124": 1848,
    "1112,663": 1849,
    "411,130": 1850,
    "65,57": 1851,
    "827,416": 1852,
    "1180,41": 1853,
    "64,63": 1854,
    "1257,1002": 1855,
    "310,283": 1856,
    "1438,54": 1857,
    "542,53": 1858,
    "1858,877": 1859,
    "937,54": 1860,
    "1370,109": 1861,
    "110,1308": 1862,
    "570,123": 1863,
    "123,305": 1864,
    "267,124": 1865,
    "266,54": 1866,
    "449,1311": 1867,
    "707,383": 1868,
    "58,58": 1869,
    "120,282": 1870,
    "268,280": 1871,
    "120,312": 1872,
    "690,126": 1873,
    "1873,282": 1874,
    "1874,107": 1875,
    "127,426": 1876,
    "287,646": 1877,
    "88,84": 1878,
    "1878,1084": 1879,
    "1879,77": 1880,
    "1074,113": 1881,
    "1881,330": 1882,
    "1882,1243": 1883,
    "299,961": 1884,
    "287,116": 1885,
    "707,757": 1886,
    "839,281": 1887,
    "290,118": 1888,
    "310,277": 1889,
    "302,416": 1890,
    "1295,425": 1891,
    "806,297": 1892,
    "298,1490": 1893,
    "106,790": 1894,
    "1894,917": 1895,
    "325,355": 1896,
    "287,317": 1897,
    "302,285": 1898,
    "107,286": 1899,
    "396,71": 1900,
    "122,363": 1901,
    "970,109": 1902,
    "324,112": 1903,
    "406,71": 1904,
    "106,269": 1905,
    "1905,269": 1906,
    "1827,761": 1907,
    "1180,52": 1908,
    "116,358": 1909,
    "79,93": 1910,
    "1910,81": 1911,
    "1911,76": 1912,
    "1912,763": 1913,
    "1913,75": 1914,
    "1914,77": 1915,
    "1334,955": 1916,
    "567,71": 1917,
    "108,571": 1918,
    "1918,111": 1919,
    "1081,123": 1920,
    "330,340": 1921,
    "107,1850": 1922,
    "354,272": 1923,
    "327,1460": 1924,
    "1924,498": 1925,
    "537,54": 1926,
    "107,318": 1927,
    "330,71": 1928,
    "725,279": 1929,
    "85,129": 1930,
    "123,1686": 1931,
    "65,61": 1932,
    "111,651": 1933,
    "449,127": 1934,
    "527,1515": 1935,
    "1301,54": 1936,
    "92,544": 1937,
    "117,265": 1938,
    "123,1240": 1939,
    "301,314": 1940,
    "120,1146": 1941,
    "1751,333": 1942,
    "124,125": 1943,
    "550,344": 1944,
    "590,108": 1945,
    "107,1856": 1946,
    "737,54": 1947,
    "116,292": 1948,
    "346,283": 1949,
    "122,327": 1950,
    "386,332": 1951,
    "739,280": 1952,
    "123,129": 1953,
    "119,47": 1954,
    "458,52": 1955,
    "120,294": 1956,
    "111,954": 1957,
    "126,374": 1958,
    "392,344": 1959,
    "639,54": 1960,
    "872,314": 1961,
    "708,1774": 1962,
    "941,898": 1963,
    "847,370": 1964,
    "551,129": 1965,
    "819,279": 1966,
    "106,387": 1967,
    "123,115": 1968,
    "1640,458": 1969,
    "337,54": 1970,
    "1543,327": 1971,
    "1971,293": 1972,
    "1074,434": 1973,
    "1973,274": 1974,
    "866,53": 1975,
    "1975,311": 1976,
    "1976,282": 1977,
    "1977,919": 1978,
    "1978,267": 1979,
    "1979,978": 1980,
    "1775,1946": 1981,
    "396,314": 1982,
    "900,307": 1983,
    "1258,274": 1984,
    "129,289": 1985,
    "326,110": 1986,
    "91,327": 1987,
    "66,48": 1988,
    "605,71": 1989,
    "709,1341": 1990,
    "75,284": 1991,
    "1991,551": 1992,
    "1992,512": 1993,
    "420,1441": 1994,
    "1211,593": 1995,
    "1423,281": 1996,
    "108,268": 1997,
    "601,497": 1998,
    "124,275": 1999,
    "1999,341": 2000,
    "725,297": 2001,
    "382,127": 2002,
    "705,322": 2003,
    "1711,325": 2004,
    "775,54": 2005,
    "117,483": 2006,
    "1950,1757": 2007,
    "1539,123": 2008,
    "1655,129": 2009,
    "850,1079": 2010,
    "122,303": 2011,
    "388,383": 2012,
    "848,54": 2013,
    "748,76": 2014,
    "1954,828": 2015,
    "788,276": 2016,
    "110,279": 2017,
    "124,1271": 2018,
    "1171,274": 2019,
    "1173,333": 2020,
    "854,54": 2021,
    "445,314": 2022,
    "105,583": 2023,
    "671,344": 2024,
    "1258,478": 2025,
    "445,593": 2026,
    "878,413": 2027,
    "112,478": 2028,
    "552,1286": 2029,
    "2029,388": 2030,
    "1836,279": 2031,
    "380,387": 2032,
    "1233,1327": 2033,
    "334,127": 2034,
    "65,681": 2035,
    "1004,620": 2036,
    "310,268": 2037,
    "118,294": 2038,
    "124,316": 2039,
    "105,71": 2040,
    "564,347": 2041,
    "125,117": 2042,
    "278,625": 2043,
    "334,359": 2044,
    "269,450": 2045,
    "960,129": 2046,
    "309,415": 2047,
    "504,54": 2048,
    "307,1568": 2049,
    "106,274": 2050,
    "127,278": 2051,
    "691,118": 2052,
    "1957,281": 2053,
    "272,120": 2054,
    "1871,837": 2055,
    "115,273": 2056,
    "1872,385": 2057,
    "920,1044": 2058,
    "699,330": 2059,
    "2059,108": 2060,
    "117,285": 2061,
    "411,409": 2062,
    "117,303": 2063,
    "2063,1777": 2064,
    "110,722": 2065,
    "1865,434": 2066,
    "290,108": 2067,
    "934,322": 2068,
    "280,690": 2069,
    "475,1232": 2070,
    "78,749": 2071,
    "2071,75": 2072,
    "2072,907": 2073,
    "2073,91": 2074,
    "90,77": 2075,
    "2075,91": 2076,
    "2076,88": 2077,
    "2077,684": 2078,
    "2078,91": 2079,
    "2079,955": 2080,
    "405,528": 2081,
    "564,54": 2082,
    "700,448": 2083,
    "286,54": 2084,
    "107,368": 2085,
    "126,485": 2086,
    "757,1576": 2087,
    "112,767": 2088,
    "267,297": 2089,
    "298,336": 2090,
    "2090,493": 2091,
    "1901,281": 2092,
    "80,718": 2093,
    "1313,380": 2094,
    "539,277": 2095,
    "1496,286": 2096,
    "1556,123": 2097,
    "380,285": 2098,
    "738,367": 2099,
    "556,71": 2100,
    "107,1060": 2101,
    "118,483": 2102,
    "1030,279": 2103,
    "280,1255": 2104,
    "1077,54": 2105,
    "800,273": 2106,
    "941,283": 2107,
    "107,287": 2108,
    "569,538": 2109,
    "1459,655": 2110,
    "112,301": 2111,
    "2111,110": 2112,
    "733,279": 2113,
    "285,117": 2114,
    "449,1512": 2115,
    "2115,113": 2116,
    "667,123": 2117,
    "1927,123": 2118,
    "689,54": 2119,
    "106,374": 2120,
    "851,303": 2121,
    "1610,386": 2122,
    "276,71": 2123,
    "319,54": 2124,
    "119,124": 2125,
    "268,293": 2126,
    "276,301": 2127,
    "1029,124": 2128,
    "107,391": 2129,
    "279,52": 2130,
    "109,113": 2131,
    "311,816": 2132,
    "124,1749": 2133,
    "551,124": 2134,
    "631,54": 2135,
    "95,109": 2136,
    "1408,111": 2137,
    "963,268": 2138,
    "282,314": 2139,
    "338,289": 2140,
    "281,52": 2141,
    "120,979": 2142,
    "324,281": 2143,
    "393,697": 2144,
    "272,127": 2145,
    "1082,123": 2146,
    "2056,107": 2147,
    "2147,521": 2148,
    "105,449": 2149,
    "2149,962": 2150,
    "2150,1014": 2151,
    "658,314": 2152,
    "1268,377": 2153,
    "1877,1145": 2154,
    "1073,1060": 2155,
    "932,129": 2156,
    "282,71": 2157,
    "110,316": 2158,
    "639,71": 2159,
    "930,658": 2160,
    "269,111": 2161,
    "1068,129": 2162,
    "819,274": 2163,
    "670,71": 2164,
    "1587,280": 2165,
    "123,525": 2166,
    "2166,118": 2167,
    "858,41": 2168,
    "1007,71": 2169,
    "603,71": 2170,
    "117,575": 2171,
    "2171,498": 2172,
    "1658,54": 2173,
    "118,447": 2174,
    "1445,279": 2175,
    "293,991": 2176,
    "1395,129": 2177,
    "120,107": 2178,
    "107,424": 2179,
    "109,71": 2180,
    "382,593": 2181,
    "112,324": 2182,
    "2182,1548": 2183,
    "893,112": 2184,
    "268,1264": 2185,
    "2131,1217": 2186,
    "2134,272": 2187,
    "851,127": 2188,
    "406,123": 2189,
    "505,277": 2190,
    "2190,691": 2191,
    "1817,856": 2192,
    "2015,1591": 2193,
    "88,1670": 2194,
    "2194,108": 2195,
    "293,126": 2196,
    "2196,1819": 2197,
    "2197,1955": 2198,
    "569,123": 2199,
    "298,274": 2200,
    "598,434": 2201,
    "2201,285": 2202,
    "482,636": 2203,
    "1084,518": 2204,
    "2204,77": 2205,
    "2205,1110": 2206,
    "2206,75": 2207,
    "75,73": 2208,
    "2208,84": 2209,
    "2209,849": 2210,
    "2210,76": 2211,
    "2211,547": 2212,
    "2212,1673": 2213,
    "264,651": 2214,
    "288,1232": 2215,
    "1171,478": 2216,
    "395,346": 2217,
    "107,383": 2218,
    "586,54": 2219,
    "1907,1088": 2220,
    "1281,264": 2221,
    "310,107": 2222,
    "709,124": 2223,
    "765,54": 2224,
    "917,54": 2225,
    "1192,123": 2226,
    "277,328": 2227,
    "2227,324": 2228,
    "1650,1088": 2229,
    "111,574": 2230,
    "106,54": 2231,
    "2016,124": 2232,
    "503,71": 2233,
    "1909,1111": 2234,
    "306,279": 2235,
    "1697,512": 2236,
    "355,413": 2237,
    "405,372": 2238,
    "1525,344": 2239,
    "716,71": 2240,
    "1684,54": 2241,
    "323,71": 2242,
    "118,738": 2243,
    "845,1621": 2244,
    "1378,377": 2245,
    "57,669": 2246,
    "105,52": 2247,
    "278,1096": 2248,
    "374,310": 2249,
    "278,129": 2250,
    "124,122": 2251,
    "64,534": 2252,
    "287,308": 2253,
    "414,286": 2254,
    "116,265": 2255,
    "976,54": 2256,
    "774,71": 2257,
    "561,54": 2258,
    "272,384": 2259,
    "1574,129": 2260,
    "273,41": 2261,
    "264,741": 2262,
    "655,355": 2263,
    "489,301": 2264,
    "278,327": 2265,
    "123,485": 2266,
    "119,106": 2267,
    "668,331": 2268,
    "2268,116": 2269,
    "2057,123": 2270,
    "658,123": 2271,
    "561,314": 2272,
    "1613,118": 2273,
    "1211,294": 2274,
    "1637,52": 2275,
    "739,117": 2276,
    "2276,884": 2277,
    "1129,54": 2278,
    "299,108": 2279,
    "840,1270": 2280,
    "306,285": 2281,
    "1187,54": 2282,
    "44,57": 2283,
    "618,52": 2284,
    "1274,978": 2285,
    "1216,314": 2286,
    "482,1880": 2287,
    "2287,85": 2288,
    "2288,967": 2289,
    "1334,77": 2290,
    "92,80": 2291,
    "2291,77": 2292,
    "2292,97": 2293,
    "1644,768": 2294,
    "105,130": 2295,
    "1639,383": 2296,
    "107,281": 2297,
    "296,698": 2298,
    "2298,108": 2299,
    "306,54": 2300,
    "313,1309": 2301,
    "607,279": 2302,
    "925,350": 2303,
    "339,625": 2304,
    "934,283": 2305,
    "1758,516": 2306,
    "667,2085": 2307,
    "120,281": 2308,
    "85,516": 2309,
    "2309,1529": 2310,
    "2310,279": 2311,
    "1756,293": 2312,
    "2312,1570": 2313,
    "1721,2089": 2314,
    "909,279": 2315,
    "108,126": 2316,
    "967,547": 2317,
    "835,933": 2318,
    "2318,85": 2319,
    "75,81": 2320,
    "2320,90": 2321,
    "2321,75": 2322,
    "2322,93": 2323,
    "2323,84": 2324,
    "2324,547": 2325,
    "1149,279": 2326,
    "680,54": 2327,
    "269,539": 2328,
    "1173,409": 2329,
    "123,308": 2330,
    "550,281": 2331,
    "122,499": 2332,
    "2218,878": 2333,
    "2333,314": 2334,
    "571,106": 2335,
    "605,123": 2336,
    "278,718": 2337,
    "668,111": 2338,
    "106,725": 2339,
    "374,107": 2340,
    "2340,1225": 2341,
    "327,123": 2342,
    "370,129": 2343,
    "1728,120": 2344,
    "328,1619": 2345,
    "2345,321": 2346,
    "2346,1730": 2347,
    "809,54": 2348,
    "382,294": 2349,
    "272,769": 2350,
    "1048,652": 2351,
    "1953,2228": 2352,
    "280,810": 2353,
    "592,1146": 2354,
    "1603,123": 2355,
    "1922,350": 2356,
    "637,350": 2357,
    "287,520": 2358,
    "290,344": 2359,
    "861,947": 2360,
    "2116,585": 2361,
    "106,105": 2362,
    "1459,1270": 2363,
    "912,54": 2364,
    "382,277": 2365,
    "108,538": 2366,
    "831,945": 2367,
    "116,738": 2368,
    "125,111": 2369,
    "276,1634": 2370,
    "107,274": 2371,
    "2371,1529": 2372,
    "107,108": 2373,
    "395,831": 2374,
    "392,1628": 2375,
    "1450,571": 2376,
    "62,534": 2377,
    "265,123": 2378,
    "1934,274": 2379,
    "1004,297": 2380,
    "1289,493": 2381,
    "484,71": 2382,
    "705,331": 2383,
    "273,123": 2384,
    "658,423": 2385,
    "106,281": 2386,
    "1967,264": 2387,
    "646,434": 2388,
    "110,423": 2389,
    "1572,54": 2390,
    "267,54": 2391,
    "493,531": 2392,
    "1626,54": 2393,
    "107,305": 2394,
    "297,52": 2395,
    "612,52": 2396,
    "1312,129": 2397,
    "1958,125": 2398,
    "61,534": 2399,
    "268,1025": 2400,
    "925,266": 2401,
    "108,391": 2402,
    "2402,279": 2403,
    "573,1484": 2404,
    "124,1632": 2405,
    "123,331": 2406,
    "348,71": 2407,
    "997,350": 2408,
    "1214,512": 2409,
    "1130,54": 2410,
    "287,512": 2411,
    "1779,281": 2412,
    "401,289": 2413,
    "105,289": 2414,
    "298,516": 2415,
    "1968,129": 2416,
    "900,264": 2417,
    "695,54": 2418,
    "740,524": 2419,
    "123,554": 2420,
    "986,52": 2421,
    "592,108": 2422,
    "2259,1217": 2423,
    "127,316": 2424,
    "1885,988": 2425,
    "124,1648": 2426,
    "845,778": 2427,
    "1424,71": 2428,
    "107,328": 2429,
    "1573,54": 2430,
    "1294,534": 2431,
    "1410,54": 2432,
    "552,330": 2433,
    "1123,621": 2434,
    "445,123": 2435,
    "106,391": 2436,
    "491,447": 2437,
    "526,778": 2438,
    "124,1026": 2439,
    "788,303": 2440,
    "367,374": 2441,
    "435,71": 2442,
    "311,317": 2443,
    "2443,113": 2444,
    "587,127": 2445,
    "847,902": 2446,
    "366,71": 2447,
    "1891,703": 2448,
    "2184,54": 2449,
    "298,484": 2450,
    "2450,303": 2451,
    "272,950": 2452,
    "818,71": 2453,
    "107,54": 2454,
    "105,981": 2455,
    "1719,694": 2456,
    "569,314": 2457,
    "129,105": 2458,
    "458,123": 2459,
    "310,485": 2460,
    "299,52": 2461,
    "280,2200": 2462,
    "2214,279": 2463,
    "84,328": 2464,
    "2383,1452": 2465,
    "609,350": 2466,
    "302,993": 2467,
    "930,123": 2468,
    "2102,123": 2469,
    "386,2048": 2470,
    "123,334": 2471,
    "2471,268": 2472,
    "1242,71": 2473,
    "1056,54": 2474,
    "1545,281": 2475,
    "310,736": 2476,
    "106,286": 2477,
    "73,277": 2478,
    "1129,123": 2479,
    "667,118": 2480,
    "550,1632": 2481,
    "1214,124": 2482,
    "404,52": 2483,
    "58,735": 2484,
    "1279,129": 2485,
    "268,493": 2486,
    "1740,123": 2487,
    "291,485": 2488,
    "1230,71": 2489,
    "1474,272": 2490,
    "519,54": 2491,
    "285,54": 2492,
    "296,54": 2493,
    "1025,314": 2494,
    "1081,314": 2495,
    "2027,129": 2496,
    "564,52": 2497,
    "869,54": 2498,
    "1370,344": 2499,
    "114,125": 2500,
    "491,54": 2501,
    "108,344": 2502,
    "120,545": 2503,
    "1545,115": 2504,
    "1456,52": 2505,
    "2237,274": 2506,
    "336,703": 2507,
    "839,344": 2508,
    "66,735": 2509,
    "1283,1183": 2510,
    "740,314": 2511,
    "1574,350": 2512,
    "535,1738": 2513,
    "487,54": 2514,
    "2238,447": 2515,
    "781,54": 2516,
    "442,538": 2517,
    "1527,54": 2518,
    "651,118": 2519,
    "361,54": 2520,
    "1983,274": 2521,
    "1029,327": 2522,
    "1344,123": 2523,
    "382,109": 2524,
    "449,329": 2525,
    "113,113": 2526,
    "1103,54": 2527,
    "116,485": 2528,
    "643,350": 2529,
    "295,52": 2530,
    "1369,120": 2531,
    "415,54": 2532,
    "315,285": 2533,
    "268,851": 2534,
    "2534,128": 2535,
    "118,282": 2536,
    "1045,943": 2537,
    "372,54": 2538,
    "2032,124": 2539,
    "63,669": 2540,
    "111,293": 2541,
    "92,284": 2542,
    "123,296": 2543,
    "111,411": 2544,
    "81,123": 2545,
    "129,41": 2546,
    "301,113": 2547,
    "672,56": 2548,
    "1616,2038": 2549,
    "2544,948": 2550,
    "666,1255": 2551,
    "1525,109": 2552,
    "283,118": 2553,
    "298,122": 2554,
    "2554,554": 2555,
    "1619,283": 2556,
    "271,118": 2557,
    "2557,111": 2558,
    "522,52": 2559,
    "1231,54": 2560,
    "123,561": 2561,
    "95,364": 2562,
    "126,347": 2563,
    "272,336": 2564,
    "64,669": 2565,
    "2254,344": 2566,
    "108,663": 2567,
    "571,2392": 2568,
    "963,2546": 2569,
    "106,267": 2570,
    "1055,71": 2571,
    "2051,682": 2572,
    "290,124": 2573,
    "275,71": 2574,
    "531,123": 2575,
    "285,310": 2576,
    "1123,275": 2577,
    "926,273": 2578,
    "2578,279": 2579,
    "114,483": 2580,
    "118,1630": 2581,
    "446,382": 2582,
    "1259,52": 2583,
    "326,71": 2584,
    "123,303": 2585,
    "58,534": 2586,
    "80,1184": 2587,
    "2587,129": 2588,
    "887,123": 2589,
    "266,126": 2590,
    "1112,525": 2591,
    "2591,927": 2592,
    "118,276": 2593,
    "1293,54": 2594,
    "599,289": 2595,
    "746,71": 2596,
    "1886,423": 2597,
    "1800,314": 2598,
    "891,123": 2599,
    "1310,54": 2600,
    "269,54": 2601,
    "1806,108": 2602,
    "2260,53": 2603,
    "1313,118": 2604,
    "2604,315": 2605,
    "275,512": 2606,
    "2003,2561": 2607,
    "389,54": 2608,
    "323,54": 2609,
    "280,124": 2610,
    "673,596": 2611,
    "450,1654": 2612,
    "2612,371": 2613,
    "1373,485": 2614,
    "290,127": 2615,
    "477,297": 2616,
    "1861,864": 2617,
    "2617,701": 2618,
    "124,273": 2619,
    "449,833": 2620,
    "107,790": 2621,
    "365,54": 2622,
    "334,120": 2623,
    "381,54": 2624,
    "1224,952": 2625,
    "282,734": 2626,
    "831,2067": 2627,
    "112,282": 2628,
    "1101,113": 2629,
    "290,2462": 2630,
    "2567,2328": 2631,
    "1379,344": 2632,
    "788,885": 2633,
    "2633,2568": 2634,
    "891,54": 2635,
    "588,1903": 2636,
    "2098,667": 2637,
    "124,885": 2638,
    "293,420": 2639,
    "2639,2331": 2640,
    "316,53": 2641,
    "2641,2332": 2642,
    "1845,458": 2643,
    "521,539": 2644,
    "477,461": 2645,
    "466,69": 2646,
    "2646,55": 2647,
    "2647,42": 2648,
    "2648,48": 2649,
    "2649,439": 2650,
    "1644,1034": 2651,
    "116,1468": 2652,
    "774,41": 2653,
    "1038,123": 2654,
    "564,274": 2655,
    "2339,294": 2656,
    "2656,917": 2657,
    "1319,54": 2658,
    "1557,281": 2659,
    "2021,2542": 2660,
    "264,1691": 2661,
    "315,391": 2662,
    "111,332": 2663,
    "1561,41": 2664,
    "126,447": 2665,
    "318,106": 2666,
    "999,54": 2667,
    "120,279": 2668,
    "1038,54": 2669,
    "78,122": 2670,
    "2670,379": 2671,
    "2671,696": 2672,
    "84,1474": 2673,
    "2673,287": 2674,
